'use strict';

/* 
Усовершенствуйте игру, которую написали в game01

бот предлагает ввести два числа, и загадывает случайное число в этом диапазоне
бот запоминает каждое число которое ввел пользователь и записывает в массив
бот отграничивает количество попыток до 30% от количества цифр в диапазоне
если пользователь повторно ввел число, которое вводил ранее, то бот выводит "Это число вы уже вводили" попытка не засчитывается
если диапазон от 50 до 100, то попыток бот даёт 15
если попытки закончились игра прекращается
*/








